[
  {
    "job_id": "inODGC64THLOxPA0AAAAAA==",
    "job_title": "Head of Technical Product management",
    "employer_name": "RELX",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSRUX2Dxff3kCpmLbe9CE3ur0OQ9-6e3B-aZr1j&s=0",
    "employer_website": null,
    "job_publisher": "ZipRecruiter",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://www.ziprecruiter.com/c/RELX/Job/Head-of-Technical-Product-management/-in-Washington,DC?jid=8024d0635da7c1aa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": true,
    "apply_options": [
      {
        "publisher": "ZipRecruiter",
        "apply_link": "https://www.ziprecruiter.com/c/RELX/Job/Head-of-Technical-Product-management/-in-Washington,DC?jid=8024d0635da7c1aa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      },
      {
        "publisher": "BeBee",
        "apply_link": "https://us.bebee.com/job/a4f22335aeba1aa977bbdd7142cc585c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Monster",
        "apply_link": "https://www.monster.com/job-openings/director-of-technical-program-management-card-integration-washington-dc--92c8c22f-b79e-471b-8ebe-7fa32f7ff1ea?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jobs For Stevenage Fans",
        "apply_link": "https://jobs.stevenagefc.com/jobs/director-of-technical-program-management-m-w-d-washington-d.c.-washington-dc/2516652854-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Aspire Media Group Jobs",
        "apply_link": "https://jobs.aspiremediagroup.net/jobs/director-of-technical-program-management-m-w-d-washington-d.c.-washington-dc/2516652854-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "KSNT Jobs",
        "apply_link": "https://jobs.ksnt.com/jobs/director-of-technical-program-management-card-integration-m-w-d-washington-d.c.-washington-dc/2528324834-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "KGET Jobs",
        "apply_link": "https://jobs.kget.com/jobs/director-of-technical-program-management-m-w-d-washington-d.c.-washington-dc/2516652854-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Lensa",
        "apply_link": "https://lensa.com/job-v1/relx/washington-dc/head-of-product/15aa0459b1e13bace3f2e26ee3e2879a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Are you a collaborative leader of Product Managers looking to work for a mission driven global organization?\n\nAbout the Team\n\nThe Academic Information Systems (AIS) portfolio, part of the Academic Leaders & Funders (AL&F) group, offers Software-as-a-Service solutions - Pure, Interfolio, and Digital Commons - to support the academic lifecycle and research management needs of universities, research organizations, and funding agencies. The AIS Technical Services Team is a global team of product managers and data and software engineers that delivers data exchange and integration projects with client enterprise platforms (e.g., HR, Finance) and external data sources and tools.\n\nAbout the Role\n\nThe Head of Technical Product Management manages a team of Technical Product Managers (TPMs): they are a customer-facing role responsible for gathering functional requirements, designing data and application integration pipelines and managing the delivery of projects. TPMs collaborate with the sales team during the pre-sales phase and work closely with data engineers and software developers to build integrations.\n\nThe Head of Technical Product Management role is key to delivering seamless, secure, and scalable integrations for our clients, ensuring exceptional service throughout the customer lifecycle and setting technical standards through both leadership and hands-on contributions.\n\nResponsibilities\n• Lead, mentor, and manage a team of Technical Product Managers providing direction, performance feedback, and professional development.\n• Oversee the design of complex integrations, ensuring alignment with client functional requirements, technical constraints, and security/compliance needs.\n• Establish, document, and enforce standards and best practices for solution design, documentation, and project delivery within the TPM team.\n• Work closely with the Data and Software Engineering Leads to implement scalable, agile ways of working within the AIS Technical Services team.\n• Collaborate with Sales, Client Services, and Customer Success teams to ensure customer satisfaction throughout the entire engagement lifecycle.\n• Collaborate with the Senior Director, AIS Technical Services, to define the organization's growth strategy and help implement initiatives aimed at improving efficiency and scaling operations.\n• Foster a culture of continuous improvement in the team; identify key strengths and development areas of the team members, support their professional growth while promoting a culture of inclusion and mutual respect.\n\nQualifications\n• Proven experience managing or leading professional services teams in a SaaS or enterprise application environment.\n• Knowledge of enterprise systems (such as HR, finance, and databases), integration patterns, APIs, and security standards.\n• Practical knowledge of Project Management and Agile methodologies.\n• Exceptional communication and stakeholder management skills, with demonstrated success in customer-facing roles.\n• Ability to develop standards, best practices, and high-quality documentation.\n• Demonstrated hands-on expertise in designing and implementing technical integrations, especially in novel or complex situations.\n• Bachelor's degree in computer science, Information Systems, or related field (or equivalent experience); advanced degree is considered a plus.\n• Excellent written and verbal communication skills. Ability to build relationships with stakeholders and the team.\n• Experience in higher education or research systems is considered a plus\n• Familiarity with Research Information Management Systems or Faculty Information Systems is considered a plus\n\nAbout the Business\n\nA global leader in information and analytics, we help researchers and healthcare professionals advance science and improve health outcomes for the benefit of society. Building on our publishing heritage, we combine quality information and vast data sets with analytics to support visionary science and research, health education and interactive learning, as well as exceptional healthcare and clinical practice. What you do every day will help advance science and healthcare to advance human progress.\n\nU.S. National Base Pay Range: $93,400 - $155,700. Geographic differentials may apply in some locations to better reflect local market rates.\n\nIf performed in New York, the pay range is $102,800 - $171,300. If performed in New York City, the pay range is $107,400 - $179,100. If performed in Rochester, NY, the pay range is $88,700 - $147,900. If performed in Ohio, the pay range is $88,700 - $147,900.\n\nThis job is eligible for an annual incentive bonus.\n\nWe know that your wellbeing and happiness are key to a long and successful career. These are some of the benefits we are delighted to offer to our US full- and part-time employees working at least 20 hours or more per week:\n\nHealth Benefits: Comprehensive, multi-carrier program for medical, dental and vision benefits\nRetirement Benefits: 401(k) with match and an Employee Share Purchase Plan\nWellbeing: Wellness platform with incentives, Headspace app subscription, Employee Assistance and Time-off Programs\nShort-and-Long Term Disability, Life and Accidental Death Insurance, Critical Illness, and Hospital Indemnity\nFamily Benefits, including bonding and family care leaves, adoption and surrogacy benefits\nHealth Savings, Health Care, Dependent Care and Commuter Spending Accounts\nIn addition to annual Paid Time Off, we offer up to two days of paid leave each to participate in Employee Resource Groups and to volunteer with your charity of choice\n\nWe are committed to providing a fair and accessible hiring process. If you have a disability or other need that requires accommodation or adjustment, please let us know by completing our Applicant Request Support Formor please contact 1-855-833-5120.\n\nCriminals may pose as recruiters asking for money or personal information. We never request money or banking details from job applicants. Learn more about spotting and avoiding scams here.\n\nPlease read our Candidate Privacy Policy.\n\nWe are an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law.\n\nUSA Job Seekers:\n\nEEO Know Your Rights.",
    "job_is_remote": false,
    "job_posted_at": "6 days ago",
    "job_posted_at_timestamp": 1766016000,
    "job_posted_at_datetime_utc": "2025-12-18T00:00:00.000Z",
    "job_location": "Washington, DC",
    "job_city": "Washington",
    "job_state": "District of Columbia",
    "job_country": "US",
    "job_latitude": 38.9071923,
    "job_longitude": -77.0368707,
    "job_benefits": [
      "paid_time_off",
      "health_insurance",
      "dental_coverage"
    ],
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DinODGC64THLOxPA0AAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_min_salary": 107000,
    "job_max_salary": 179000,
    "job_salary_period": "YEAR",
    "job_highlights": {
      "Qualifications": [
        "Proven experience managing or leading professional services teams in a SaaS or enterprise application environment",
        "Knowledge of enterprise systems (such as HR, finance, and databases), integration patterns, APIs, and security standards",
        "Practical knowledge of Project Management and Agile methodologies",
        "Exceptional communication and stakeholder management skills, with demonstrated success in customer-facing roles",
        "Ability to develop standards, best practices, and high-quality documentation",
        "Demonstrated hands-on expertise in designing and implementing technical integrations, especially in novel or complex situations",
        "Excellent written and verbal communication skills",
        "Ability to build relationships with stakeholders and the team"
      ],
      "Benefits": [
        "U.S. National Base Pay Range: $93,400 - $155,700",
        "Geographic differentials may apply in some locations to better reflect local market rates",
        "If performed in New York, the pay range is $102,800 - $171,300",
        "If performed in New York City, the pay range is $107,400 - $179,100",
        "If performed in Rochester, NY, the pay range is $88,700 - $147,900",
        "If performed in Ohio, the pay range is $88,700 - $147,900",
        "This job is eligible for an annual incentive bonus",
        "Health Benefits: Comprehensive, multi-carrier program for medical, dental and vision benefits",
        "Retirement Benefits: 401(k) with match and an Employee Share Purchase Plan",
        "Wellbeing: Wellness platform with incentives, Headspace app subscription, Employee Assistance and Time-off Programs",
        "Short-and-Long Term Disability, Life and Accidental Death Insurance, Critical Illness, and Hospital Indemnity",
        "Family Benefits, including bonding and family care leaves, adoption and surrogacy benefits",
        "Health Savings, Health Care, Dependent Care and Commuter Spending Accounts",
        "In addition to annual Paid Time Off, we offer up to two days of paid leave each to participate in Employee Resource Groups and to volunteer with your charity of choice"
      ],
      "Responsibilities": [
        "The Head of Technical Product Management manages a team of Technical Product Managers (TPMs): they are a customer-facing role responsible for gathering functional requirements, designing data and application integration pipelines and managing the delivery of projects",
        "TPMs collaborate with the sales team during the pre-sales phase and work closely with data engineers and software developers to build integrations",
        "The Head of Technical Product Management role is key to delivering seamless, secure, and scalable integrations for our clients, ensuring exceptional service throughout the customer lifecycle and setting technical standards through both leadership and hands-on contributions",
        "Lead, mentor, and manage a team of Technical Product Managers providing direction, performance feedback, and professional development",
        "Oversee the design of complex integrations, ensuring alignment with client functional requirements, technical constraints, and security/compliance needs",
        "Establish, document, and enforce standards and best practices for solution design, documentation, and project delivery within the TPM team",
        "Work closely with the Data and Software Engineering Leads to implement scalable, agile ways of working within the AIS Technical Services team",
        "Collaborate with Sales, Client Services, and Customer Success teams to ensure customer satisfaction throughout the entire engagement lifecycle",
        "Collaborate with the Senior Director, AIS Technical Services, to define the organization's growth strategy and help implement initiatives aimed at improving efficiency and scaling operations",
        "Foster a culture of continuous improvement in the team; identify key strengths and development areas of the team members, support their professional growth while promoting a culture of inclusion and mutual respect"
      ]
    },
    "job_onet_soc": "11202100",
    "job_onet_job_zone": "4"
  },
  {
    "job_id": "fxaa-RICLwr8YP0HAAAAAA==",
    "job_title": "Product Manager II - Staking Data Platform",
    "employer_name": "Coinbase",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmDWP8Ja_lclFUPsSJjJDyOh5pw2CWbxa8dVdb&s=0",
    "employer_website": "https://www.coinbase.com",
    "job_publisher": "Lensa",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://lensa.com/job-v1/coinbase/washington-dc/product-manager/36162d2c6ab424b2756782638d84d702?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "Lensa",
        "apply_link": "https://lensa.com/job-v1/coinbase/washington-dc/product-manager/36162d2c6ab424b2756782638d84d702?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Ready to be pushed beyond what you think you’re capable of?\n\nAt Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system.\n\nTo achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems.\n\nOur work culture is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be.\n\nWhile many roles at Coinbase are remote-first, we are not remote-only. In-person participation is required throughout the year. Team and company-wide offsites are held multiple times annually to foster collaboration, connection, and alignment. Attendance is expected and fully supported.\n\nStaking is the #3 revenue-generating products at Coinbase ($700M+ ARR in 2024). The Staking Platform team builds platform services to empower high quality staking products for our retail and institutional customers. This way, people don’t just buy / sell crypto, they “earn” on crypto, and in the meantime provide security and decentralization for underlying blockchain networks.\n\nWe design the interface that abstracts blockchain complexities into simple and easy-to-use platform APIs for all our product teams at Coinbase. We must be at the forefront of crypto, operating blockchains at scale, designing new products and solving hard engineering problems to make the latest staking technologies accessible to people around the world. We take on challenging problems in user experience, security and blockchain technology.\n\nOn the Staking Platform team, you’ll be tasked with learning about new blockchains and technologies, and enabling new utilities through existing and new products for our users. You’ll work with leadership to turn ideas into reliable products and infrastructure for Coinbase.\n\nWhat you’ll be doing (ie. job duties):**\n• Own a product area and define long-term strategy for areas such as Staking Protocol Integrations & infrastructure, International expansion and support\n• Develop products & services for internal and external developer audiences.\n• Own managing the addition of multiple assets including network launches and staking support across Consumer and Insto products.\n• Own product management of public-facing developer tools and communities managed by Staking Platform team\n• Research and stay ahead of new and upcoming technology in the crypto space, and build relationships with key community members.\n• Drive adoption of staking and crypto-first product features, working closely with partners on product teams.\n\nWhat we look for in you (ie. job requirements):**\n• Minimum of 5+ years experience in product management or elsewhere in a similar capacity (product-minded engineer or entrepreneur).\n• You’re familiar with the crypto ecosystem, be it DeFi, protocol technologies, crypto developer tools or more.\n• You’re passionate about building an open financial system that brings the world together.\n• You’re an excellent communicator, comfortable talking to individual contributors and executive leadership.\n• Aptitude for learning and ability to ramp quickly on new and potentially complicated domains\n• Ability to focus on scalable platform and business outcomes\n• An execution-focused mindset, capable of navigating through ambiguity and delivering results.\n\nNice to haves:\n• Previous project or work experience in crypto-native projects (i.e. Staking, NFTs, DeFi, DAOs, RWAs, etc.)\n• Crypto-forward experience, including familiarity with staking, onchain activity such as interacting with Ethereum addresses, using ENS, and engaging with dApps or blockchain-based services.\n\nID: GPPM05US\n\nPay Transparency Notice: Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Coinbase also include bonus eligibility + equity eligibility**+ benefits (including medical, dental, vision and 401(k)).\n\nPay Range:\n\n$180,370—$212,200 USD\n\nPlease be advised that each candidate may submit a maximum of four applications within any 30-day period. We encourage you to carefully evaluate how your skills and interests align with Coinbase's roles before applying.\n\nCommitment to Equal Opportunity\n\nCoinbase is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may view the Employee Rights and the Know Your Rights notices by clicking on their corresponding links. Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law.\n\nCoinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here).\n\nGlobal Data Privacy Notice for Job Candidates and Applicants\n\nDepending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required.\n\nAI Disclosure\n\nFor select roles, Coinbase is piloting an AI tool based on machine learning technologies to conduct initial screening interviews to qualified applicants. The tool simulates realistic interview scenarios and engages in dynamic conversation. A human recruiter will review your interview responses, provided in the form of a voice recording and/or transcript, to assess them against the qualifications and characteristics outlined in the job description.\n\nFor select roles, Coinbase is also piloting an AI interview intelligence platform to transcribe and summarize interview notes, allowing our interviewers to fully focus on you as the candidate.\n\nThe above pilots are for testing purposes and Coinbase will not use AI to make decisions impacting employment. To request a reasonable accommodation due to disability, please contact accommodations[at]coinbase.com",
    "job_is_remote": false,
    "job_posted_at": null,
    "job_posted_at_timestamp": null,
    "job_posted_at_datetime_utc": null,
    "job_location": "Washington, DC",
    "job_city": "Washington",
    "job_state": "District of Columbia",
    "job_country": "US",
    "job_latitude": 38.9071923,
    "job_longitude": -77.0368707,
    "job_benefits": [
      "paid_time_off",
      "dental_coverage",
      "health_insurance"
    ],
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3Dfxaa-RICLwr8YP0HAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {
      "Qualifications": [
        "We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up",
        "We want someone who will run towards, not away from, solving the company’s hardest problems",
        "Minimum of 5+ years experience in product management or elsewhere in a similar capacity (product-minded engineer or entrepreneur)",
        "You’re familiar with the crypto ecosystem, be it DeFi, protocol technologies, crypto developer tools or more",
        "You’re passionate about building an open financial system that brings the world together",
        "You’re an excellent communicator, comfortable talking to individual contributors and executive leadership",
        "Aptitude for learning and ability to ramp quickly on new and potentially complicated domains",
        "Ability to focus on scalable platform and business outcomes",
        "An execution-focused mindset, capable of navigating through ambiguity and delivering results",
        "Previous project or work experience in crypto-native projects (i.e. Staking, NFTs, DeFi, DAOs, RWAs, etc.)",
        "Crypto-forward experience, including familiarity with staking, onchain activity such as interacting with Ethereum addresses, using ENS, and engaging with dApps or blockchain-based services"
      ],
      "Benefits": [
        "Pay Transparency Notice: Depending on your work location, the target annual salary for this position can range as detailed below",
        "Full time offers from Coinbase also include bonus eligibility + equity eligibility**+ benefits (including medical, dental, vision and 401(k))",
        "$180,370—$212,200 USD"
      ],
      "Responsibilities": [
        "In-person participation is required throughout the year",
        "Team and company-wide offsites are held multiple times annually to foster collaboration, connection, and alignment",
        "Attendance is expected and fully supported",
        "On the Staking Platform team, you’ll be tasked with learning about new blockchains and technologies, and enabling new utilities through existing and new products for our users",
        "You’ll work with leadership to turn ideas into reliable products and infrastructure for Coinbase",
        "Own a product area and define long-term strategy for areas such as Staking Protocol Integrations & infrastructure, International expansion and support",
        "Develop products & services for internal and external developer audiences",
        "Own managing the addition of multiple assets including network launches and staking support across Consumer and Insto products",
        "Own product management of public-facing developer tools and communities managed by Staking Platform team",
        "Research and stay ahead of new and upcoming technology in the crypto space, and build relationships with key community members",
        "Drive adoption of staking and crypto-first product features, working closely with partners on product teams"
      ]
    },
    "job_onet_soc": "11202100",
    "job_onet_job_zone": "4"
  },
  {
    "job_id": "t2RKt47Sz_Hvk9ObAAAAAA==",
    "job_title": "Senior Associate, Product Manager, Debit Decisioning",
    "employer_name": "Capital One",
    "employer_logo": null,
    "employer_website": "https://www.capitalone.com",
    "job_publisher": "Capital One Careers",
    "job_employment_type": "Full-time and Part-time",
    "job_employment_types": [
      "FULLTIME",
      "PARTTIME"
    ],
    "job_apply_link": "https://www.capitalonecareers.com/en/job/mclean/senior-associate-product-manager-debit-decisioning/1732/88214580080?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "Capital One Careers",
        "apply_link": "https://www.capitalonecareers.com/en/job/mclean/senior-associate-product-manager-debit-decisioning/1732/88214580080?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "AnitaB.org Job Board",
        "apply_link": "https://jobs.anitab.org/companies/capital-one/jobs/61890186-senior-associate-product-manager-debit-decisioning?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Built In",
        "apply_link": "https://builtin.com/job/senior-associate-product-manager-debit-decisioning/7648304?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "GameJobs.co",
        "apply_link": "https://gamejobs.co/Senior-Product-Marketing-Manager-Emerging-Technologies-at-Unity?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "LinkedIn",
        "apply_link": "https://www.linkedin.com/jobs/view/senior-associate-product-manager-debit-decisioning-at-capital-one-4334939011?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Diversity Jobs",
        "apply_link": "https://diversityjobs.com/career/14774561/Senior-Associate-Product-Manager-Debit-Decisioning-New-York-New-York?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Milwaukee Jobs",
        "apply_link": "https://www.milwaukeejobs.com/job/detail/85436276/Senior-Associate-Product-Manager-Debit-Decisioning?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jobright",
        "apply_link": "https://jobright.ai/jobs/info/6910d7d4988c2b7b4ec52bbe?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Senior Associate, Product Manager, Debit Decisioning\n\nProduct Management at Capital One is a booming, vibrant craft that requires reimagining the status quo, finding value creation opportunities, and driving innovative and sustainable customer experiences through technology. We believe our portfolio of businesses and investments in growth and transformation will result in a company with the scale, brand, capabilities, talent, and values to succeed as the digital revolution transforms our society and our industry.\n\nAbout the Debit Authorizations Decisioning Team:\n\nEvery time our customers use their debit cards we make a decision - should we allow this transaction to go through? Our mission is twofold: make it seamless for good customers to use their debit cards to spend and manage their money, and impossible for bad actors to do so. To accomplish this, we build the intelligent data-driven brain behind authorizations, managing the policies, models, and data integrations that power our automated decisions. We are a team of strategists, builders, and customer advocates who thrive on solving complex problems at the intersection of technology, data, and human experience. The Debit Authorizations Decisioning Product Manager will focus on building additional data sources for our models and decisioning and partnering with downstream teams to improve the “post-decline” experience. This is a highly collaborative role, who will work closely with product managers across Capital One in the Retail Bank and Enterprise teams, engineers, data scientists, operations, and business partners to continue to evolve our debit authorizations platform and strategy.\n\nCapital One Product Framework\n\nIn this role, you’ll be expected to demonstrate proficiency in five key areas which we consider to be the foundation for successful Product management:\n• Human Centered - Obsesses about internal and external customer needs to reimagine and innovate product solutions\n• Business Focused - Delivers game-changing outcomes by focusing on leverage and execution excellence\n• Technology Driven - Leverages technology to deliver innovative and resilient solutions that enable both near term and long term value\n• Integrated Problem Solving - Identifies and resolves complex problems to deliver outcomes while mitigating product risks\n• Transformational Leadership - Leads cross functional teams to solve customer problems and drive organizational alignment\n\nBasic Qualifications:\n• Bachelor’s Degree or military experience\n• At least 2 years of experience working in Product Management\n\nPreferred Qualifications:\n• Bachelor’s degree in computer science or engineering\n• Experience translating business strategy and analysis into consumer facing digital products\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\nMcLean, VA: $109,000 - $124,400 for Sr. Associate, Product Management\n\nNew York, NY: $118,900 - $135,700 for Sr. Associate, Product Management\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\n\nThis role is expected to accept applications for a minimum of 5 business days.\n\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
    "job_is_remote": false,
    "job_posted_at": "24 days ago",
    "job_posted_at_timestamp": 1764460800,
    "job_posted_at_datetime_utc": "2025-11-30T00:00:00.000Z",
    "job_location": "McLean, VA",
    "job_city": "McLean",
    "job_state": "Virginia",
    "job_country": "US",
    "job_latitude": 38.9338676,
    "job_longitude": -77.1772604,
    "job_benefits": [
      "health_insurance"
    ],
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3Dt2RKt47Sz_Hvk9ObAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {
      "Qualifications": [
        "Human Centered - Obsesses about internal and external customer needs to reimagine and innovate product solutions",
        "Bachelor’s Degree or military experience",
        "At least 2 years of experience working in Product Management"
      ],
      "Benefits": [
        "Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked",
        "McLean, VA: $109,000 - $124,400 for Sr",
        "New York, NY: $118,900 - $135,700 for Sr",
        "Candidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter",
        "This role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI)",
        "Incentives could be discretionary or non discretionary depending on the plan",
        "Capital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being"
      ],
      "Responsibilities": [
        "The Debit Authorizations Decisioning Product Manager will focus on building additional data sources for our models and decisioning and partnering with downstream teams to improve the “post-decline” experience",
        "This is a highly collaborative role, who will work closely with product managers across Capital One in the Retail Bank and Enterprise teams, engineers, data scientists, operations, and business partners to continue to evolve our debit authorizations platform and strategy",
        "Capital One Product Framework",
        "In this role, you’ll be expected to demonstrate proficiency in five key areas which we consider to be the foundation for successful Product management:",
        "Technology Driven - Leverages technology to deliver innovative and resilient solutions that enable both near term and long term value",
        "Integrated Problem Solving - Identifies and resolves complex problems to deliver outcomes while mitigating product risks",
        "Transformational Leadership - Leads cross functional teams to solve customer problems and drive organizational alignment"
      ]
    },
    "job_onet_soc": "11202100",
    "job_onet_job_zone": "4"
  },
  {
    "job_id": "1JoxiK-72U112HloAAAAAA==",
    "job_title": "Director - Digital Product",
    "employer_name": "Five Guys",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTzDZG0-IehHYs76EKxZpyVqcVA5f6WOd2GHawr&s=0",
    "employer_website": "https://www.fiveguys.com",
    "job_publisher": "ZipRecruiter",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://www.ziprecruiter.com/c/Five-Guys/Job/Director-Digital-Product/-in-Alexandria,VA?jid=0f13e978841e0826&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": true,
    "apply_options": [
      {
        "publisher": "ZipRecruiter",
        "apply_link": "https://www.ziprecruiter.com/c/Five-Guys/Job/Director-Digital-Product/-in-Alexandria,VA?jid=0f13e978841e0826&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      },
      {
        "publisher": "Breakroom",
        "apply_link": "https://www.breakroom.cc/en-us/jobs/listing/19504073-five-guys-director-digital-product-alexandria-22314-united?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Based at our corporate offices in Alexandria, VA, the Director - Digital Product will develop, implement and maintain Five Guys' digital product strategy, including managing guest-facing digital platforms, applications, and 3rd party delivery & catering relationships. This position will be a creative, strategic thinker who can analyze customer data to optimize the entire customer experience journey across all digital platforms.\n\nThe Director - Digital Product will utilize gleaned customer insights into actionable strategies to drive customer engagement and sales across Five Guys digital platforms. This position will partner with internal and external teams across the company to create high-impact campaigns that drive conversions, engagement, and sales.\n\nEssential Duties and Responsibilities:\n• Own roadmap and customer experience for all guest-facing digital platforms - Five Guys app, web ordering, kiosks, and digital menu boards.\n• Define KPIs, use data and guest feedback to inform leadership on product decisions and prioritizations.\n• Ensure all digital campaigns hit the mark in terms of strategic goals, sales, and customer engagement.\n• Ensure the development of universal, frictionless, and seamless customer journeys across all digital platforms.\n• Partner with marketing, CRM, loyalty, and data teams to translate business needs into clear product requirements and technical solutions.\n• Strategically develop and steer 3rd party sales channel relationships - DSPs, ezCater, e.g.\n• Experiment, iterate, and optimize customer engagement across all digital platforms.\n• Ensure cross-functional collaboration to launch and optimize features.\n• Ensure platform reliability and performance across all digital channels.\n• Stay updated on emerging digital trends, AI-driven personalization, and customer experience innovations.\n\nQualifications Guidelines:\nThe requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nEducation/Experience:\n• Bachelor's degree in Marketing, Business, or related field, Required.\n• MBA or Graduate Degree, Preferred\n• 10+ years experience in the digital space with a strong focus on digital platforms and sales channels.\n• 5+ years of management experience.\n\nComputer Skills:\nExceptional computer skills required in Microsoft Office Suite, Internet, and other appropriate software\n\nSupervisory Responsibilities:\nThis position requires supervisory responsibilities\n\nPhysical Demands:\nOccasional travel will be required, with business needs dictating >50% in certain periods of time.\n\nThe above job description is not intended to be an all-inclusive list of duties and standards of the position. Incumbents will follow any other instructions, and perform any other related duties, as assigned by their supervisor, policy and company management.\n\nEqual Opportunity Employer\nThis employer is required to notify all applicants of their rights pursuant to federal employment laws. For further information, please review the Know Your Rights notice from the Department of Labor.",
    "job_is_remote": false,
    "job_posted_at": null,
    "job_posted_at_timestamp": null,
    "job_posted_at_datetime_utc": null,
    "job_location": "Alexandria, VA",
    "job_city": "Alexandria",
    "job_state": "Virginia",
    "job_country": "US",
    "job_latitude": 38.804693,
    "job_longitude": -77.0435257,
    "job_benefits": null,
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3D1JoxiK-72U112HloAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {
      "Qualifications": [
        "The requirements listed below are representative of the knowledge, skill, and/or ability required",
        "Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions",
        "Bachelor's degree in Marketing, Business, or related field, Required",
        "10+ years experience in the digital space with a strong focus on digital platforms and sales channels",
        "5+ years of management experience",
        "Exceptional computer skills required in Microsoft Office Suite, Internet, and other appropriate software"
      ],
      "Responsibilities": [
        "This position will be a creative, strategic thinker who can analyze customer data to optimize the entire customer experience journey across all digital platforms",
        "The Director - Digital Product will utilize gleaned customer insights into actionable strategies to drive customer engagement and sales across Five Guys digital platforms",
        "This position will partner with internal and external teams across the company to create high-impact campaigns that drive conversions, engagement, and sales",
        "Own roadmap and customer experience for all guest-facing digital platforms - Five Guys app, web ordering, kiosks, and digital menu boards",
        "Define KPIs, use data and guest feedback to inform leadership on product decisions and prioritizations",
        "Ensure all digital campaigns hit the mark in terms of strategic goals, sales, and customer engagement",
        "Ensure the development of universal, frictionless, and seamless customer journeys across all digital platforms",
        "Partner with marketing, CRM, loyalty, and data teams to translate business needs into clear product requirements and technical solutions",
        "Strategically develop and steer 3rd party sales channel relationships - DSPs, ezCater, e.g",
        "Experiment, iterate, and optimize customer engagement across all digital platforms",
        "Ensure cross-functional collaboration to launch and optimize features",
        "Ensure platform reliability and performance across all digital channels",
        "Stay updated on emerging digital trends, AI-driven personalization, and customer experience innovations",
        "This position requires supervisory responsibilities",
        "Occasional travel will be required, with business needs dictating >50% in certain periods of time",
        "Incumbents will follow any other instructions, and perform any other related duties, as assigned by their supervisor, policy and company management"
      ]
    },
    "job_onet_soc": "11202100",
    "job_onet_job_zone": "4"
  },
  {
    "job_id": "efnpZkRo6QjDYG31AAAAAA==",
    "job_title": "Senior Product Manager - AI for Unstructured Data, Commercial Bank",
    "employer_name": "Capital One",
    "employer_logo": null,
    "employer_website": "https://www.capitalone.com",
    "job_publisher": "Teal",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://www.tealhq.com/job/senior-product-manager-ai-for-unstructured-data-commercial-bank_36b4d14b-022c-4d39-a633-de47cac04108?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "Teal",
        "apply_link": "https://www.tealhq.com/job/senior-product-manager-ai-for-unstructured-data-commercial-bank_36b4d14b-022c-4d39-a633-de47cac04108?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Cadde Marina",
        "apply_link": "https://www.caddemarina.nl/job-listing/job/senior-systems-testing-manager-at-capital-one-mclean-va-a2xCWld6c01ISGxaU3RxZTR3cEVRVTNLK3c9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Chicago AI Week",
        "apply_link": "https://chicagoaiweek.com/vacancy/job/senior-systems-testing-manager-at-capital-one-mclean-va-eldoeEgxUDNqWHhJd2swc3BpU3hBOW9IRGc9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Ec-W.ch",
        "apply_link": "https://ec-w.ch/office/job/sr-project-manager-commercial-bank-at-capital-one-mclean-va-djJPN0pQRWNpdG0wem5BSmNqV0x0WVBPaGc9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "PW Fios E Cabos",
        "apply_link": "https://pwfiosecabos.com.br/gig/job/sr-project-manager-commercial-bank-at-capital-one-mclean-va-c2dQOTZRRkRObWtRYk1NaXYrQTE3dWFKNVE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Firenze Lodging",
        "apply_link": "https://firenzelodging.it/samples/job/senior-tax-manager-federal-tax-planning-team-at-capital-one-mclean-va-UDFQZkE1MGZVSThJaVdkYi9nRDNIOHRZY2c9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Luca Ciuti, CCS",
        "apply_link": "https://lucaciuti.com/jobs/job/senior-manager-product-manager-bank-modernization-at-capital-one-mclean-va-WFF0MzA1dEFoQVJCbnZ4T3k5MGhaL0lBeXc9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Eyes By Design",
        "apply_link": "https://eyesbydesign.ca/job-listing/job/senior-tax-manager-federal-tax-planning-team-at-capital-one-mclean-va-QWxteExiQU8wTzVsKzVEM1RjRWdGMVpsU0E9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "About the position\n\nProduct Management at Capital One is a booming, vibrant craft that requires reimagining the status quo, finding value creation opportunities, and driving innovative and sustainable customer experiences through technology. We believe our portfolio of businesses and investments in growth and transformation will result in a company with the scale, brand, capabilities, talent, and values to succeed as the digital revolution transforms our society and our industry.\n\nResponsibilities\n• Develop and champion a compelling product vision and long-term strategy for AI-driven document understanding, aligning with broader company objectives and emerging market trends\n• Own the product roadmap from conception to launch. Translate the strategy into detailed requirements, user stories, and product specifications in close collaboration with engineering, data science, and design teams\n• Stay at the forefront of advancements in the AI/ML space. Identify and translate emerging technologies and new ideas into tangible product capabilities that solve real-world customer problems\n• Foster a data-driven culture of rapid iteration and experimentation. Define hypotheses, design and execute A/B tests, and use quantitative and qualitative data to guide product decisions and optimize model performance\n• Serve as the product leader and domain expert within a cross-functional team. Drive product development in a dynamic environment, ensuring alignment and proactively managing shifting priorities to meet ambitious timelines\n• Engage deeply with customers and stakeholders to understand their pain points, gather feedback, and validate product concepts. Be the voice of the customer in every conversation\n• Partner with product marketing, sales, and customer success teams to launch new products and features, ensuring successful market adoption and clear communication of value propositions\n\nRequirements\n• At least 5 years of experience working in Product Management\n• Currently has, or is in the process of obtaining a Bachelor's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, Computer Engineering, Software Engineering, Mechanical Engineering, Information Systems or a related quantitative field) or a Master's Degree in a quantitative field or an MBA with a quantitative concentration\n\nNice-to-haves\n• 3+ years of experience building and shipping AI/ML-powered products or features\n• Experience translating business strategy and analysis into consumer facing digital products\n\nBenefits\n• Comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being\n• Performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI)",
    "job_is_remote": false,
    "job_posted_at": null,
    "job_posted_at_timestamp": null,
    "job_posted_at_datetime_utc": null,
    "job_location": "McLean, VA",
    "job_city": "McLean",
    "job_state": "Virginia",
    "job_country": "US",
    "job_latitude": 38.9338676,
    "job_longitude": -77.1772604,
    "job_benefits": [
      "health_insurance"
    ],
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DefnpZkRo6QjDYG31AAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {
      "Qualifications": [
        "At least 5 years of experience working in Product Management",
        "Currently has, or is in the process of obtaining a Bachelor's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, Computer Engineering, Software Engineering, Mechanical Engineering, Information Systems or a related quantitative field) or a Master's Degree in a quantitative field or an MBA with a quantitative concentration",
        "3+ years of experience building and shipping AI/ML-powered products or features",
        "Experience translating business strategy and analysis into consumer facing digital products"
      ],
      "Benefits": [
        "Comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being",
        "Performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI)"
      ],
      "Responsibilities": [
        "Develop and champion a compelling product vision and long-term strategy for AI-driven document understanding, aligning with broader company objectives and emerging market trends",
        "Own the product roadmap from conception to launch",
        "Translate the strategy into detailed requirements, user stories, and product specifications in close collaboration with engineering, data science, and design teams",
        "Stay at the forefront of advancements in the AI/ML space",
        "Identify and translate emerging technologies and new ideas into tangible product capabilities that solve real-world customer problems",
        "Foster a data-driven culture of rapid iteration and experimentation",
        "Define hypotheses, design and execute A/B tests, and use quantitative and qualitative data to guide product decisions and optimize model performance",
        "Serve as the product leader and domain expert within a cross-functional team",
        "Drive product development in a dynamic environment, ensuring alignment and proactively managing shifting priorities to meet ambitious timelines",
        "Engage deeply with customers and stakeholders to understand their pain points, gather feedback, and validate product concepts",
        "Be the voice of the customer in every conversation",
        "Partner with product marketing, sales, and customer success teams to launch new products and features, ensuring successful market adoption and clear communication of value propositions"
      ]
    },
    "job_onet_soc": "11202100",
    "job_onet_job_zone": "4"
  }
]