[
  {
    "job_id": "lZXzBij9EBLI6gELAAAAAA==",
    "job_title": "Sales Associate, Part Time - Washington D.C.",
    "employer_name": "Charles Tyrwhitt Inc",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTAG-d9soCO0migZdP1iQ1ME3-2DPcyTA1_Bxqq&s=0",
    "employer_website": null,
    "job_publisher": "Indeed",
    "job_employment_type": "Part-time",
    "job_employment_types": [
      "PARTTIME"
    ],
    "job_apply_link": "https://www.indeed.com/viewjob?jk=dbe89404cdaace98&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": true,
    "apply_options": [
      {
        "publisher": "Indeed",
        "apply_link": "https://www.indeed.com/viewjob?jk=dbe89404cdaace98&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      },
      {
        "publisher": "ZipRecruiter",
        "apply_link": "https://www.ziprecruiter.com/c/Charles-Tyrwhitt-Inc/Job/Sales-Associate,-Part-Time-Washington-D.C./-in-Washington,DC?jid=595c66517aa78af0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      },
      {
        "publisher": "LinkedIn",
        "apply_link": "https://www.linkedin.com/jobs/view/sales-associate-part-time-washington-d-c-at-charles-tyrwhitt-4318603410?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Glassdoor",
        "apply_link": "https://www.glassdoor.com/job-listing/sales-associate-part-time-washington-d-c-charles-tyrwhitt-JV_IC1138213_KO0,40_KE41,57.htm?jl=1009917893130&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      },
      {
        "publisher": "SimplyHired",
        "apply_link": "https://www.simplyhired.com/job/ypxz2W2WOPEn_XHtIqHh9xNviNfkWjmTah039P997bbQhPRg213OKA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "BeBee",
        "apply_link": "https://us.bebee.com/job/4568ef6075d27495917397a454acd909?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "JobLeads",
        "apply_link": "https://www.jobleads.com/us/job/sales-associate-part-time-washington-d-c--washington--ead57bfa49da47cf919103697f8ca1689?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jobilize",
        "apply_link": "https://www.jobilize.com/job/us-dc-washington-sales-associate-part-time-d-c-charles-tyrwhitt-hiring?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "The Role\n\nAt Charles Tyrwhitt our purpose is to “Make it easy for men to dress well” and we can’t do that without our specialist teams. At this time, we’re on the lookout for a Part Time, Sales Associate who will be working with Lloyd from our Washington D.C. store location.\n\nWhat you will be doing\n\nAs a Sales Associate, you’ll be the heartbeat of the store, delivering exceptional customer service that turns every visit into a memorable shopping experience. You’ll greet customers with a warm welcome, offer expert product advice, and make the checkout process smooth and friendly. We’ll provide you with hands-on training to help you grow your knowledge of menswear styling, measuring, and creating polished looks.\n\nWhat we are looking for\n\nCustomer Service experience is essential, preferably in a premium retail environment. Your personality and enthusiasm, combined with your experience will make you a person who is fun to work with, taking pride in appearance, and always with a driven, can-do attitude. Full training is provided to help you understand our brand, product, and customer.\n\nWhat you can expect from us\n\nCT is a privately-owned business, so we're not a big corporate-style place to work. Our senior leaders are transparent and approachable, and we welcome ideas to make this a great place to work. We value our people whilst being product and customer obsessed. We offer excellent benefits while working here, these include:\n• Quarterly bonus based on team sales performance\n• Uniform allowance from day one - from top to toe in Charles Tyrwhitt!\n• Part-time paid time off\n• PayActiv partnership: get wages already earned before payday!\n• Employee Assistance Program\n• This role requires work authorization to work in person within the United States*\n• As required by law, this role can reasonably be expected to pay a base salary to the successful candidate anywhere between $17.95 - $20.00 per hour. This is dependent upon experience related to the role*\n\nWho we are\n\nOnce upon a shirt, Nicholas Charles Tyrwhitt Wheeler had the notion that he could make a better shirt at better value than anyone else in the world! He believed that all men; no matter their shape or size, where they may be in the world or indeed their budget; should be able to own a Jermyn Street quality shirt. A proper shirt. A CT shirt.\n\nThat was over 3 decades ago and whilst Charles Tyrwhitt (it rhymes with spirit by the way) is still famous for proper shirts, these days we are about so much more than collars and cuffs. Our purpose is to “make it easy for men to dress well”. We take care of the entire wardrobe, providing stylish solutions for every occasion. We make sure he gets what he wants, when and how he wants it.\n\nCharles Tyrwhitt’s spiritual home and flagship store is located on London’s Jermyn Street, in the United Kingdom where our presence is well known. We also have a strong online presence in the US, with retail stores in 7 states and a New York head office. We also operate across Europe and Australia! Pretty impressive, eh? And as of 2022, we're proud to be recognized as a carbon-neutral retailer as we continue our journey to be a sustainable business.\n\nLearn more about us at https://www.charlestyrwhitt.careers/\n\n‘I am Proud and Free to be me!’\n\nTyrwhitteers (our people) are a diverse, passionate and entrepreneurial group. We enjoy a fun, engaging and rewarding culture, where everyone is empowered by our 3 BE-liefs which are; “BE the BOSS”, “BE the CUSTOMER” and “BE the BEST”. We want colleagues to love working for CT and for it to feel like a place where they can be, and want to be, themselves.",
    "job_is_remote": false,
    "job_posted_at": null,
    "job_posted_at_timestamp": null,
    "job_posted_at_datetime_utc": null,
    "job_location": "Washington, DC",
    "job_city": "Washington",
    "job_state": "District of Columbia",
    "job_country": "US",
    "job_latitude": 38.9071923,
    "job_longitude": -77.0368707,
    "job_benefits": [
      "paid_time_off"
    ],
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DlZXzBij9EBLI6gELAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_min_salary": 17.95,
    "job_max_salary": 20,
    "job_salary_period": "HOUR",
    "job_highlights": {
      "Qualifications": [
        "Customer Service experience is essential, preferably in a premium retail environment",
        "Your personality and enthusiasm, combined with your experience will make you a person who is fun to work with, taking pride in appearance, and always with a driven, can-do attitude",
        "This role requires work authorization to work in person within the United States*",
        "A proper shirt",
        "A CT shirt"
      ],
      "Benefits": [
        "Quarterly bonus based on team sales performance",
        "Uniform allowance from day one - from top to toe in Charles Tyrwhitt!",
        "Part-time paid time off",
        "PayActiv partnership: get wages already earned before payday!",
        "Employee Assistance Program",
        "As required by law, this role can reasonably be expected to pay a base salary to the successful candidate anywhere between $17.95 - $20.00 per hour"
      ],
      "Responsibilities": [
        "As a Sales Associate, you’ll be the heartbeat of the store, delivering exceptional customer service that turns every visit into a memorable shopping experience",
        "You’ll greet customers with a warm welcome, offer expert product advice, and make the checkout process smooth and friendly",
        "We’ll provide you with hands-on training to help you grow your knowledge of menswear styling, measuring, and creating polished looks"
      ]
    },
    "job_onet_soc": "41203100",
    "job_onet_job_zone": "2"
  },
  {
    "job_id": "kTMs3ZgWXsrXy7TvAAAAAA==",
    "job_title": "Showroom (Sales) - Associate, Design Sales",
    "employer_name": "TileBar",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT7vFRvVrD47fcCaR1r769jRTTNDuL3j-Swzk3_&s=0",
    "employer_website": "https://www.tilebar.com",
    "job_publisher": "SalesJobs.com",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://www.salesjobs.com/sales-job/51010083?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "SalesJobs.com",
        "apply_link": "https://www.salesjobs.com/sales-job/51010083?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Snagajob",
        "apply_link": "https://www.snagajob.com/jobs/1202324649?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Founded in 2006, Soho Studio/TileBar is a young tile company built in the 21st century, with forward-thinking business practices, which utilize technology and the web to run the most streamlined and efficient company in order to create savings and pass them on to the customer. We are seeking an enthusiastic and service-driven Showroom Design Consultant to join our Logan Circle Showroom, opening June 2025. In this role, you will be working directly with a diverse clientele, ranging from homeowners to designers & architects to contractors and installers, offering each personalized service and expert advice. TileBar offers a competitive compensation package that includes a strong base salary and commission incentives. The salary range for this position is $70,000 to $80,000 per year. Actual compensation is based on multiple factors that are unique to each candidate, including but not limited to skill set, level of relevant experience, and specific work location. Salary ranges for positions based in other locations may differ based on the cost of labor in that location. Responsibilities To thrive in this role, you will be expected to successfully perform the following duties: Client Engagement: Serve as the primary point of contact for clients, offering expert advice, addressing inquiries, and resolving issues promptly and professionally to ensure satisfaction and a seamless experience. Design & Consultation: Curate materials and recommend the ideal products for a wide range of residential and commercial applications. Create custom room packages and design boards that reflect the needs and desires of our clients. Product Knowledge: Maintain an in-depth understanding of TileBars product offerings, brand values, and industry trends, and share this knowledge with clients to provide the best solutions. Sales & Order Management: Handle the entire sales process, from quoting and order fulfillment to processing purchase orders and sample requests. Ensure all sales activities are logged and tracked within our CRM system. Team Collaboration: Work closely with local team to ensure all brand standards are met. Work in partnership across the organization to ensure timely and efficient order processing and delivery. Relationship Building: Establish and maintain long-lasting client relationships, helping to foster loyalty and repeat business. Brand Ambassador: Be a consistent and positive representation of TileBars brand image and culture in all interactions. Upholding our values, vision and commitment to exceptional customer service. This may include additional duties as requested. Qualifications The requirements listed below are representative of the qualifications necessary to perform the job. Experience & Education * High School Diploma or equivalent required; Bachelors Degree preferred. * 3-5 years of sales or customer service experience, preferably in retail, showroom, or luxury sales environments. * Experience in tile, natural stone, textiles, furniture, building materials, or supply chain industries is a plus. Sales & Customer Engagement * Proven ability to meet and exceed sales targets and KPIs through consultative selling techniques. * Strong relationship-building skills with a customer-first mindset to drive satisfaction and repeat business. * Ability to educate and guide clients through product selection, project planning, and design solutions. * Exceptional verbal and written communication skills to engage with customers, colleagues, and industry professionals. Product Knowledge & Industry Expertise * Knowledge of tile, stone, and flooring materials, including product applications and industry trends, is preferred. * Willingness to learn and stay updated on product specifications, installation methods, and design trends. * Ability to effectively present and recommend products tailored to client needs. Operational & Technical Proficiency * Tech-savvy, with frequent use of Microsoft Office Suite (Excel, Word, Outlook, PowerPoint) * Experience with SalesPad, Magento, Salesforce, or similar CRM systems is a plus. * Strong math and problem-solving skills for order processing, quoting, and pricing. * Familiarity with logistics and supply chain processes to ensure smooth order fulfillment. Time Management & Team Collaboration * Strong time management and multitasking abilities in a fast-paced showroom environment. * Ability to work both independently and collaboratively within a high-performing sales team. * Excellent interpersonal skills with a proactive, solution-oriented approach. Additional Requirements * Flexibility to work retail hours, including weekends, evenings, and special events as needed. * Ability to lift up to 25 lbs. for sample movement and showroom maintenance. * Occasional travel required for market events, training, or showroom openings. At Soho Studio LLC/TileBar, we are committed to fostering a workplace that embraces and celebrates diversity, equity, and inclusion. We believe that a diverse and inclusive workforce not only enhances our ability to innovate and succeed but also creates a more enriching and supportive environment for our employees. Soho Studio LLC/TileBar is an equal opportunity employer and welcomes applications from all qualified individuals, regardless of their race, color, religion, gender, sexual orientation, gender identity or expression, national origin, genetics, age, disability, or veteran status.",
    "job_is_remote": false,
    "job_posted_at": null,
    "job_posted_at_timestamp": null,
    "job_posted_at_datetime_utc": null,
    "job_location": "Washington, DC",
    "job_city": "Washington",
    "job_state": "District of Columbia",
    "job_country": "US",
    "job_latitude": 38.9071923,
    "job_longitude": -77.0368707,
    "job_benefits": null,
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DkTMs3ZgWXsrXy7TvAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {
      "Qualifications": [
        "3-5 years of sales or customer service experience, preferably in retail, showroom, or luxury sales environments",
        "Strong relationship-building skills with a customer-first mindset to drive satisfaction and repeat business",
        "Ability to educate and guide clients through product selection, project planning, and design solutions",
        "Exceptional verbal and written communication skills to engage with customers, colleagues, and industry professionals",
        "Product Knowledge & Industry Expertise",
        "Willingness to learn and stay updated on product specifications, installation methods, and design trends",
        "Ability to effectively present and recommend products tailored to client needs",
        "Operational & Technical Proficiency",
        "Tech-savvy, with frequent use of Microsoft Office Suite (Excel, Word, Outlook, PowerPoint)",
        "Strong math and problem-solving skills for order processing, quoting, and pricing",
        "Familiarity with logistics and supply chain processes to ensure smooth order fulfillment",
        "Strong time management and multitasking abilities in a fast-paced showroom environment",
        "Ability to work both independently and collaboratively within a high-performing sales team",
        "Excellent interpersonal skills with a proactive, solution-oriented approach",
        "Flexibility to work retail hours, including weekends, evenings, and special events as needed",
        "Ability to lift up to 25 lbs. for sample movement and showroom maintenance",
        "Occasional travel required for market events, training, or showroom openings"
      ],
      "Benefits": [
        "TileBar offers a competitive compensation package that includes a strong base salary and commission incentives",
        "The salary range for this position is $70,000 to $80,000 per year",
        "Actual compensation is based on multiple factors that are unique to each candidate, including but not limited to skill set, level of relevant experience, and specific work location",
        "Salary ranges for positions based in other locations may differ based on the cost of labor in that location"
      ],
      "Responsibilities": [
        "Responsibilities To thrive in this role, you will be expected to successfully perform the following duties: Client Engagement: Serve as the primary point of contact for clients, offering expert advice, addressing inquiries, and resolving issues promptly and professionally to ensure satisfaction and a seamless experience",
        "Design & Consultation: Curate materials and recommend the ideal products for a wide range of residential and commercial applications",
        "Create custom room packages and design boards that reflect the needs and desires of our clients",
        "Product Knowledge: Maintain an in-depth understanding of TileBars product offerings, brand values, and industry trends, and share this knowledge with clients to provide the best solutions",
        "Sales & Order Management: Handle the entire sales process, from quoting and order fulfillment to processing purchase orders and sample requests",
        "Ensure all sales activities are logged and tracked within our CRM system",
        "Team Collaboration: Work closely with local team to ensure all brand standards are met",
        "Work in partnership across the organization to ensure timely and efficient order processing and delivery",
        "Relationship Building: Establish and maintain long-lasting client relationships, helping to foster loyalty and repeat business",
        "Brand Ambassador: Be a consistent and positive representation of TileBars brand image and culture in all interactions",
        "Upholding our values, vision and commitment to exceptional customer service",
        "This may include additional duties as requested",
        "Sales & Customer Engagement",
        "Proven ability to meet and exceed sales targets and KPIs through consultative selling techniques"
      ]
    },
    "job_onet_soc": "41203100",
    "job_onet_job_zone": "2"
  },
  {
    "job_id": "1t2Q7yaOudQZf0hcAAAAAA==",
    "job_title": "P&G Professional Sales Account Executive, Baltimore Territory",
    "employer_name": "PGBPGNGLOBAL",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTbnl0qvHNDlOuF9HwN_XmkOfVKtrUQdt7iYnGy&s=0",
    "employer_website": null,
    "job_publisher": "P&G Careers",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://www.pgcareers.com/global/en/job/R000139742/P-G-Professional-Sales-Account-Executive-Baltimore-Territory?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "P&G Careers",
        "apply_link": "https://www.pgcareers.com/global/en/job/R000139742/P-G-Professional-Sales-Account-Executive-Baltimore-Territory?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Indeed",
        "apply_link": "https://www.indeed.com/viewjob?jk=aab648ee6428c8e2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Glassdoor",
        "apply_link": "https://www.glassdoor.com/job-listing/pg-professional-sales-account-executive-baltimore-territory-procter-gamble-JV_IC1153527_KO0,59_KE60,74.htm?jl=1009909940472&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "ZipRecruiter",
        "apply_link": "https://www.ziprecruiter.com/c/Proctor-&-Gamble/Job/P&G-Professional-Sales-Account-Executive,-Baltimore-Territory/-in-Baltimore,MD?jid=67453f28286e0a73&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      },
      {
        "publisher": "SimplyHired",
        "apply_link": "https://www.simplyhired.com/job/pHkqd9YajiRfRCoe1yiOWepo1sM0stAyu7DJRBta1mCd0jzxNixolQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "LinkedIn",
        "apply_link": "https://www.linkedin.com/jobs/view/p-g-professional-sales-account-executive-baltimore-territory-at-procter-gamble-4312426597?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Talent.com",
        "apply_link": "https://www.talent.com/view?id=c20204a73313&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "BeBee",
        "apply_link": "https://us.bebee.com/job/ad62a7cda3280cd4c40b058ea78a0f16?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Job Location\nBaltimore\n\nJob Description\n\nP&G Professional is a leading manufacturer and marketer of away from home products. P&G Professional Account Executives manage our business with Jan/San and Foodservice distributors, hospitality, healthcare, restaurants and other independent businesses. They develop business building ideas and sell these ideas to our accounts, as well as manage their implementation. They market products which will enable customers to meet their consumers' needs. P&G Professional Account Executives are part of a multi-functional Customer Team which includes experts in Finance, Logistics, Marketing, and Information Systems to provide the resources needed to develop a new and successful way of doing business.\n\nWe are looking for individuals who are leaders and have a history of making things happen. We are seeking candidates who are analytical thinkers and problem solvers, as well as excellent communicators. We are looking for someone who can set priorities and follow through on commitments, as well as demonstrate creativity, innovation, and initiative. Previous experience in Jan/San sales area is a plus, but not required.\n\nAccount Executives are expected to influence the customer's marketing, finance, logistics, and other critical business decisions. Our selling begins with developing a concept - a new way of looking at events or business - then pulling together the information to explain the concept and finally persuading our account to accept the recommendation for one or more specific courses of action. Account Executives are expected to become knowledgeable in advertising, promotions, finance, and merchandising, as well as develop expertise in areas such as product knowledge and technical support.\n\nJob Qualifications\n\nRequirements:\n• Bachelor's degree\n• Valid driver’s license\n• Work will be done in these market territories: Baltimore Metropolitan Region, 2-hour radius surrounding Baltimore\n• Residence in the local market territory.\n• Travel Requirement: 95% of time in the field; 20% travel\n• Core business hours: 9am to 5pm, Monday thru Friday, some weekends and evening shifts required for overnight installs\n\nPreferred, but not required:\n• Experience in a field-based sales position\n• Previous experience in the food service sales area\n• Experience in the JanSan industries, hospitality, healthcare, food service, and working with distributors\n• Spanish proficiency (oral/written)\n\nCompensation for roles at P&G varies depending on a wide array of non-discriminatory factors including but not limited to the specific office location, role, degree/credentials, relevant skill set, and level of relevant experience. At P&G compensation decisions are dependent on the facts and circumstances of each case. Total rewards at P&G include salary + bonus (if applicable) + benefits. Your recruiter may be able to share more about our total rewards offerings and the specific salary range for the relevant location(s) during the hiring process.\n\nWe are committed to providing equal opportunities in employment. We value diversity and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nImmigration Sponsorship is not available for this role. For more information regarding who is eligible for hire at P&G along with other work authorization FAQ’s, please click HERE.\n\nProcter & Gamble participates in e-verify as required by law.\n\nQualified individuals will not be disadvantaged based on being unemployed.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n\nJob Schedule\nFull time\n\nJob Number\nR000139742\n\nJob Segmentation\nExperienced Professionals\n\nStarting Pay / Salary Range\n$85,000.00 - $115,000.00 / year",
    "job_is_remote": false,
    "job_posted_at": null,
    "job_posted_at_timestamp": null,
    "job_posted_at_datetime_utc": null,
    "job_location": "Washington, DC",
    "job_city": "Washington",
    "job_state": "District of Columbia",
    "job_country": "US",
    "job_latitude": 38.9071923,
    "job_longitude": -77.0368707,
    "job_benefits": [
      "health_insurance"
    ],
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3D1t2Q7yaOudQZf0hcAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {
      "Qualifications": [
        "We are seeking candidates who are analytical thinkers and problem solvers, as well as excellent communicators",
        "We are looking for someone who can set priorities and follow through on commitments, as well as demonstrate creativity, innovation, and initiative",
        "Bachelor's degree",
        "Valid driver’s license",
        "Work will be done in these market territories: Baltimore Metropolitan Region, 2-hour radius surrounding Baltimore",
        "Residence in the local market territory",
        "Core business hours: 9am to 5pm, Monday thru Friday, some weekends and evening shifts required for overnight installs"
      ],
      "Benefits": [
        "Compensation for roles at P&G varies depending on a wide array of non-discriminatory factors including but not limited to the specific office location, role, degree/credentials, relevant skill set, and level of relevant experience",
        "Total rewards at P&G include salary + bonus (if applicable) + benefits",
        "Your recruiter may be able to share more about our total rewards offerings and the specific salary range for the relevant location(s) during the hiring process",
        "Starting Pay / Salary Range",
        "$85,000.00 - $115,000.00 / year"
      ],
      "Responsibilities": [
        "They develop business building ideas and sell these ideas to our accounts, as well as manage their implementation",
        "They market products which will enable customers to meet their consumers' needs",
        "P&G Professional Account Executives are part of a multi-functional Customer Team which includes experts in Finance, Logistics, Marketing, and Information Systems to provide the resources needed to develop a new and successful way of doing business",
        "Account Executives are expected to influence the customer's marketing, finance, logistics, and other critical business decisions",
        "Our selling begins with developing a concept - a new way of looking at events or business - then pulling together the information to explain the concept and finally persuading our account to accept the recommendation for one or more specific courses of action",
        "Account Executives are expected to become knowledgeable in advertising, promotions, finance, and merchandising, as well as develop expertise in areas such as product knowledge and technical support",
        "Travel Requirement: 95% of time in the field; 20% travel"
      ]
    },
    "job_onet_soc": "41401200",
    "job_onet_job_zone": "4"
  },
  {
    "job_id": "L38301ceQ3Ov7oeiAAAAAA==",
    "job_title": "Entry Level Sales Agents",
    "employer_name": "Horizon",
    "employer_logo": null,
    "employer_website": "https://horizon.com",
    "job_publisher": "SalesJobs.com",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://www.salesjobs.com/sales-job/51006973?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "SalesJobs.com",
        "apply_link": "https://www.salesjobs.com/sales-job/51006973?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jobilize",
        "apply_link": "https://www.jobilize.com/job/us-dc-columbia-entry-level-sales-trainer-washington-redis-marketing?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Theinjobs.com",
        "apply_link": "https://www.theinjobs.com/entry-level-sales-representative-job-in-washington-dc-view-c603a1e1bcea6825?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Job Summary We are seeking a motivated and enthusiastic Entry Level Sales Reps to join our dynamic team. Must have excellent interpersonal and written communication skills. The Entry Level Rep educate home owners on the benefits of renewable energy. Immediate positions available. Weekly base pay plus commission. If you're energetic and ready to take control of your career ,this is the perfect opportunity for you ! Responsibilities * Greet customers warmly and assist them with inquiries about products and services. * Provide knowledgeable recommendations based on customer needs and preferences. * Educate home owners on the benefits of switching to renewable energy. * Develop new customers and fostering relationships * Assisting customers through the enrollment process. Skills * Strong customer service skills with a friendly and approachable demeanor. * Basic sales skills or a willingness to learn effective selling techniques. * Excellent communication skills, both verbal and written. * Confident, assertive and quick thinking * Team-oriented mindset with a commitment to achieving collective goals. * Strategic Selling Join us as an Entry Level Rep and embark on an exciting journey where you can grow your skills and make meaningful connections with customers! Job Types: Full-time, Part-time Pay: $800.00 - $1,200.00 per week Benefits: * Flexible schedule * Opportunities for advancement Compensation Package: * Bonus opportunities * Commission pay * Performance bonus * Weekly bonus Schedule: * Day shift * Evening shift * Monday to Friday * Morning shift * Weekends as needed People with a criminal record are encouraged to apply Work Location: In person",
    "job_is_remote": false,
    "job_posted_at": null,
    "job_posted_at_timestamp": null,
    "job_posted_at_datetime_utc": null,
    "job_location": "Washington, DC",
    "job_city": "Washington",
    "job_state": "District of Columbia",
    "job_country": "US",
    "job_latitude": 38.9071923,
    "job_longitude": -77.0368707,
    "job_benefits": null,
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DL38301ceQ3Ov7oeiAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {
      "Qualifications": [
        "Must have excellent interpersonal and written communication skills",
        "The Entry Level Rep educate home owners on the benefits of renewable energy",
        "Strong customer service skills with a friendly and approachable demeanor",
        "Basic sales skills or a willingness to learn effective selling techniques",
        "Excellent communication skills, both verbal and written",
        "Confident, assertive and quick thinking",
        "Team-oriented mindset with a commitment to achieving collective goals",
        "Strategic Selling Join us as an Entry Level Rep and embark on an exciting journey where you can grow your skills and make meaningful connections with customers!"
      ],
      "Benefits": [
        "Weekly base pay plus commission",
        "Job Types: Full-time, Part-time Pay: $800.00 - $1,200.00 per week Benefits:",
        "Flexible schedule",
        "Opportunities for advancement Compensation Package:",
        "Bonus opportunities",
        "Commission pay",
        "Performance bonus",
        "Weekly bonus Schedule:",
        "Day shift",
        "Monday to Friday"
      ],
      "Responsibilities": [
        "Greet customers warmly and assist them with inquiries about products and services",
        "Provide knowledgeable recommendations based on customer needs and preferences",
        "Educate home owners on the benefits of switching to renewable energy",
        "Develop new customers and fostering relationships",
        "Assisting customers through the enrollment process"
      ]
    },
    "job_onet_soc": "41401100",
    "job_onet_job_zone": "4"
  },
  {
    "job_id": "HU_qr93DgjENqLZzAAAAAA==",
    "job_title": "Sales Development Representative, Latin America",
    "employer_name": "Okta",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTMrq7TfJ79hBuQdx4udbZQ9wksEJSvkjYFlCf-&s=0",
    "employer_website": "https://www.okta.com",
    "job_publisher": "ZipRecruiter",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://www.ziprecruiter.com/c/Okta/Job/Sales-Development-Representative,-Latin-America/-in-Washington,DC?jid=a82011888682be19&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": true,
    "apply_options": [
      {
        "publisher": "ZipRecruiter",
        "apply_link": "https://www.ziprecruiter.com/c/Okta/Job/Sales-Development-Representative,-Latin-America/-in-Washington,DC?jid=a82011888682be19&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      },
      {
        "publisher": "Glassdoor",
        "apply_link": "https://www.glassdoor.com/job-listing/sales-development-representative-latin-america-okta-JV_IC1138213_KO0,46_KE47,51.htm?jl=1009917042341&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "SalesJobs.com",
        "apply_link": "https://www.salesjobs.com/sales-job/51010315?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jooble",
        "apply_link": "https://jooble.org/jdp/7418679314879812806?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Teal",
        "apply_link": "https://www.tealhq.com/job/sales-development-representative-benefits-technology_ebcfb208-bec5-48ed-8549-50bf8c90ec02?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "CareerBuilder",
        "apply_link": "https://www.careerbuilder.com/job/J3T5J571WBM4CQ9LMNG?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "BeBee",
        "apply_link": "https://us.bebee.com/job/c6b235017c7ab6957e47af0b843f9b59?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Learn4Good",
        "apply_link": "https://www.learn4good.com/jobs/washington/district-of-columbia/info_technology/4664566581/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Get to know OktaOkta is The World's Identity Company. We free everyone to safely use any technology, anywhere, on any device or app. Our flexible and neutral products, Okta Platform and Auth0 Platform, provide secure access, authentication, and automation, placing identity at the core of business security and growth.\n\nAt Okta, we celebrate a variety of perspectives and experiences. We are not looking for someone who checks every single box - we're looking for lifelong learners and people who can make us better with their unique experiences.\n\nJoin our team! We're building a world where Identity belongs to you.\n\nWashington, DC - Onsite 4 Days/Week (Mon-Thurs)\n\nRelocation required if not local - no relocation assistance provided\n\nThe Team\n\nAt Okta, we're building the world's identity platform - one that empowers people, protects data, and fuels digital innovation. Our customers (think: JetBlue, T-Mobile, Sonos, Zoom) trust us to help them stay secure, seamless, and scalable in a world where everything and everyone is connected.\n\nAnd behind the tech? People like you - curious, motivated, collaborative learners who want to do meaningful work alongside great teammates.\n\nThe Opportunity: Where High Potential Meets High Impact\n\nLet's be real: There are a lot of SDR roles out there. But at Okta, we do things differently.\n\nThis isn't just a stepping stone - it's your launchpad into a long-term sales career in one of the most exciting industries in tech: cybersecurity and identity.\n\nWe're looking for driven, curious individuals who thrive in fast-paced environments, embrace feedback, and want to make a tangible impact every day. As an SDR at Okta, you'll do more than prospect - you'll uncover real business challenges, collaborate cross-functionally, and set the foundation for meaningful customer relationships.\n\nWhat You'll Be Doing:\n• Research accounts and contacts to develop thoughtful outreach strategies using tools like Salesforce, Outreach, and LinkedIn Sales Navigator\n• Collaborate with Marketing and Account Executives to plan and execute prospecting campaigns\n• Engage inbound leads and perform outbound outreach to generate high-quality meetings and opportunities\n• Conduct discovery conversations to understand business needs and tee up your Account Executives for success\n• Hit your call, email, meeting, and pipeline goals - and have fun doing it, with team competitions, shout-outs, and ongoing support\n• Keep your data organized and up-to-date in Salesforce\n• Work with cross-functional partners to continuously improve how we connect with our customers\n\nWhat Makes You a Great Fit:\n• Bachelor's degree or equivalent work experience\n• 6-12 months of prior business experience preferred\n• A strong communicator, written and verbal - you know how to connect\n• Fluent in English and Portuguese (spoken and written)\n• Self-motivated and goal-oriented - you take initiative and follow through\n• Comfortable managing priorities in a fast-paced, evolving environment\n• Coachable - you're open to feedback and eager to grow\n• Curious - you ask great questions and are always looking to learn\n• Familiarity with sales tools like Salesforce, Outreach, and Sales Navigator is a plus\n\nA Few Logistics\n• This role is onsite in our Washington DC office 4 days per week (Mon-Thursday)\n• If you're not already local, you'll need to relocate within an agreed-upon timeframe - note that Okta does not provide relocation assistance\n• You'll attend in-person onboarding in either San Francisco or Chicago to kick off your journey\n• If you need a reasonable accommodation during the application or interview process, let us know here\n\nWhy Okta?\n\nYou could sell anything - so why not sell something that truly matters?\n\nAt Okta, we help people and businesses access the technology they need safely and easily. And behind our mission is a culture of trust, growth, and belonging. We invest in our people with real support, meaningful work, and the freedom to take ownership of your career from day one.\n\nJoin us, and you won't just be starting a job - you'll be joining a company that's defining what's next in identity, and building a safer digital world for everyone.\n\nLearn more about Okta's Sales Development Program here\n\n#LI-onsite\n\nFY26Sourcing\n\nBelow is the annual On Target Compensation (OTE) range for candidates located in California (excluding San Francisco Bay Area), Colorado, Illinois, New York and Washington. Your actual OTE, which is inclusive of base salary and incentive compensation, will depend on factors such as your skills, qualifications, experience, and work location. In addition, Okta offers equity (where applicable) and benefits, including health, dental and vision insurance, 401(k), flexible spending account, and paid leave (including PTO and parental leave) in accordance with our applicable plans and policies. To learn more about our Total Rewards program please visit: https://rewards.okta.com/us.\n\nThe annual OTE range for this position for candidates located in California (excluding San Francisco Bay Area), Colorado, Illinois, New York, and Washington is between:\n\n$82,008-$82,008 USD\n\nWhat you can look forward to as a Full-Time Okta employee!\n• Amazing Benefits\n• Making Social Impact\n• Developing Talent and Fostering Connection + Community at Okta\n\nOkta cultivates a dynamic work environment, providing the best tools, technology and benefits to empower our employees to work productively in a setting that best and uniquely suits their needs. Each organization is unique in the degree of flexibility and mobility in which they work so that all employees are enabled to be their most creative and successful versions of themselves, regardless of where they live. Find your place at Okta today! https://www.okta.com/company/careers/.\n\nSome roles may require travel to one of our office locations for in-person onboarding.\n\nOkta is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, marital status, age, physical or mental disability, or status as a protected veteran. We also consider for employment qualified applicants with arrest and convictions records, consistent with applicable laws.\n\nIf reasonable accommodation is needed to complete any part of the job application, interview process, or onboarding please use this Form to request an accommodation.\n\nOkta is committed to complying with applicable data privacy and security laws and regulations. For more information, please see our Personnel and Job Candidate Privacy Notice at https://www.okta.com/legal/personnel-policy/.",
    "job_is_remote": false,
    "job_posted_at": null,
    "job_posted_at_timestamp": null,
    "job_posted_at_datetime_utc": null,
    "job_location": "Washington, DC",
    "job_city": "Washington",
    "job_state": "District of Columbia",
    "job_country": "US",
    "job_latitude": 38.9071923,
    "job_longitude": -77.0368707,
    "job_benefits": [
      "paid_time_off",
      "dental_coverage",
      "health_insurance"
    ],
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DHU_qr93DgjENqLZzAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {
      "Qualifications": [
        "Bachelor's degree or equivalent work experience",
        "A strong communicator, written and verbal - you know how to connect",
        "Fluent in English and Portuguese (spoken and written)",
        "Self-motivated and goal-oriented - you take initiative and follow through",
        "Comfortable managing priorities in a fast-paced, evolving environment",
        "Coachable - you're open to feedback and eager to grow",
        "Curious - you ask great questions and are always looking to learn",
        "If you're not already local, you'll need to relocate within an agreed-upon timeframe - note that Okta does not provide relocation assistance"
      ],
      "Benefits": [
        "This role is onsite in our Washington DC office 4 days per week (Mon-Thursday)",
        "Below is the annual On Target Compensation (OTE) range for candidates located in California (excluding San Francisco Bay Area), Colorado, Illinois, New York and Washington",
        "Your actual OTE, which is inclusive of base salary and incentive compensation, will depend on factors such as your skills, qualifications, experience, and work location",
        "In addition, Okta offers equity (where applicable) and benefits, including health, dental and vision insurance, 401(k), flexible spending account, and paid leave (including PTO and parental leave) in accordance with our applicable plans and policies",
        "To learn more about our Total Rewards program please visit: https://rewards.okta.com/us",
        "$82,008-$82,008 USD",
        "Amazing Benefits",
        "Making Social Impact"
      ],
      "Responsibilities": [
        "Relocation required if not local - no relocation assistance provided",
        "Research accounts and contacts to develop thoughtful outreach strategies using tools like Salesforce, Outreach, and LinkedIn Sales Navigator",
        "Collaborate with Marketing and Account Executives to plan and execute prospecting campaigns",
        "Engage inbound leads and perform outbound outreach to generate high-quality meetings and opportunities",
        "Conduct discovery conversations to understand business needs and tee up your Account Executives for success",
        "Hit your call, email, meeting, and pipeline goals - and have fun doing it, with team competitions, shout-outs, and ongoing support",
        "Keep your data organized and up-to-date in Salesforce",
        "Work with cross-functional partners to continuously improve how we connect with our customers",
        "You'll attend in-person onboarding in either San Francisco or Chicago to kick off your journey"
      ]
    },
    "job_onet_soc": "41401400",
    "job_onet_job_zone": null
  }
]